package task_51_70;

/*
Տրված է եռանիշ թիվ։ Հաշվել և արտածել եռանիշ թվի տասնավորների և միավորների թվանշանների հարաբերության արժեքը,
եթե եռանիշ թիվը մեծ է 300-ից, հակառակ դեպքում՝ հարյուրավորների և միավորների հարաբերության արժեքը։ Ենթադրվում է, որ
եռանիշ թվի միավորների թվանշանը հավասար չէ զրոյի։
*/
public class Task_57 {
    public static void main(String[] args) {

        int num = 482;
        int a, b, c;
        a = num % 10;
        b = num % 100 / 10;
        c = num % 1000 / 100;

        if (num > 300) {
            System.out.println(b / a);
        } else {
            System.out.println(c / a);
        }
    }
}
