package task_51_70;

/*
Տրված է քառանիշ թիվ։ Հաշվել և արտածել քառանիշ թվի հարաբերության արժեքը միավորների և հարյուրավորների թվանշանների
գումարին, եթե քառանիշ թիվը փոքր է 5000-ից, հակառակ դեպքում՝ քառանիշ թվի հարաբերության արժեքը հազարավորների ու
տասնավորների թվանշանների գումարին։ Ենթադրվում է, որ քառանիշ թվի միավորների և հարյուրավորիների թվանշանների գումարը
հավասար չէ զրոյի։
*/
public class Task_62 {
    public static void main(String[] args) {

        int num = 8694;
        int a, b, c, d;
        a = num % 10;
        b = num % 100 / 10;
        c = num % 1000 / 100;
        d = num % 10000 / 1000;

        if (num < 5000) {
            System.out.println(num / (a + c));
        } else {
            System.out.println(num / (b + d));
        }
    }
}
